package com.adamin.nettyandroid.netty;

/*
    ___        __                   _        ____   ____ 
   /   |  ____/ /____ _ ____ ___   (_)____  / __ \ / __ \
  / /| | / __  // __ `// __ `__ \ / // __ \/ /_/ // / / /
 / ___ |/ /_/ // /_/ // / / / / // // / / /\__, // /_/ / 
/_/  |_|\__,_/ \__,_//_/ /_/ /_//_//_/ /_//____/ \____/  
                                                         
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
                 做一款产品       愉悦自己      		   
****************Powered by Adamin90********************
* @email: 14846869@qq.com
* Date: 2020/3/20
* Time: 11:15
* Desc: 消息状态监听
* @link: https://www.lixiaopeng.top
*******************************************************
*/
public interface OnMessageStateListener {

    void isSendSuccess(boolean success);
}
